           01 ALUGAR2.
               02 BLANK SCREEN.
               02 LINE 01 COL 01 VALUE "******************************".
               02 LINE 02 COL 10 VALUE "ALUGUEL".
               02 LINE 03 COL 02 VALUE "DIGITE O CPF DO CLIENTE".
               02 LINE 04 COL 03 PIC 9(11) TO SCLIENTE.
