           01 CADFILME.
               02 BLANK SCREEN.
               02 LINE 01 COL 01 VALUE "******************************".
               02 LINE 02 COL 05 VALUE "CADASTRAR FILME".
               02 LINE 03 COL 01 VALUE "CÓDIGO:".
               02 LINE 03 COL 13 PIC Z(4) TO WS-FCOD.
               02 LINE 04 COL 01 VALUE "TÍTULO:".
               02 LINE 04 COL 13 PIC X(50) TO WS-FNOME.
               02 LINE 05 COL 01 VALUE "SINOPSE:".
               02 LINE 05 COL 13 PIC X(256) TO WS-FSIN.
