           01 DEVOLVER.
               02 BLANK SCREEN.
               02 LINE 01 COL 01 VALUE "******************************".
               02 LINE 02 COL 10 VALUE "DEVOLUÇÃO".
               02 LINE 03 COL 02 VALUE "DIGITE O CÓDIGO DO FILME".
               02 LINE 04 COL 03 PIC 9(4) TO SFILME.
