       FD ARQ-CLIENTES.
       01 REG-CLIENTES.
           05 CNOME PIC X(50).
           05 CCPF PIC 9(11).
           05 CCEP PIC 9(8).
           05 CRUA PIC X(50).
           05 CNUM PIC 9(5).
           05 CBAI PIC X(50).
           05 CCID PIC X(50).
           05 CUF PIC X(2).
