       FD ARQ-FILMES.
       01 REG-FILMES.
           05 FNOME PIC X(50).
           05 FCOD PIC 9(4).
           05 FSIN PIC X(256).
           05 FACPF PIC 9(11).
