           01 GERENCIAR.
               02 BLANK SCREEN.
               02 LINE 01 COL 01 VALUE "******************************".
               02 LINE 02 COL 13 VALUE "GERENCIAR".
               02 LINE 03 COL 03 VALUE "(1) CADASTRAR CLIENTE".
               02 LINE 06 COL 03 VALUE "(2) CADASTRAR FILME".
               02 LINE 09 COL 03 VALUE "(3) VOLTAR".
               02 LINE 10 COL 03 PIC 9 TO OP.
