           01 MENUU.
               02 BLANK SCREEN.
               02 LINE 01 COL 01 VALUE "******************************".
               02 LINE 02 COL 13 VALUE "MENU".
               02 LINE 03 COL 03 VALUE "(1) ALUGAR".
               02 LINE 04 COL 03 VALUE "(2) DEVOLVER".
               02 LINE 05 COL 03 VALUE "(3) RELATÓRIOS".
               02 LINE 06 COL 03 VALUE "(4) GERENCIAR".
               02 LINE 07 COL 03 VALUE "(5) SAIR".
               02 LINE 08 COL 03 PIC 9 TO OP.
