           01 RELATORIOS.
               02 BLANK SCREEN.
               02 LINE 01 COL 01 VALUE "******************************".
               02 LINE 02 COL 13 VALUE "RELATÓRIOS".
               02 LINE 03 COL 03 VALUE "(1) LISTAR CATÁLOGO".
               02 LINE 04 COL 03 VALUE "(2) LISTAR CLIENTES".
               02 LINE 05 COL 03 VALUE "(3) LISTAR ALUGADOS".
               02 LINE 06 COL 03 VALUE "(4) VOLTAR".
               02 LINE 07 COL 03 PIC 9 TO OP.
